app/Forms/ProductForm.php

    public function buildForm()
    {
        $arr_categories = DB::table('categories')->pluck('name','id')->all();
---
select `name`, `id` from `categories`