app/Helpers/helpers.php

function getCategory(){
    $cate = DB::table('categories')->get();
---
select * from `categories`

function getSlider(){
    $sliders = DB::table('slider')->get();
---
select * from `slider`

function getProduct(){
    $products = DB::table('products')->where('is_feature',1)->orderBy('id', 'DESC')->paginate(3);
---
select * from `products` where `is_feature` = 1 order by `id` desc limit 3 offset 0
select count(*) as aggregate from `products` where `is_feature` = 1

function getInfor(){
    $infor = DB::table('infor_main')->where('status',1)->first();
---
select * from `infor_main` where `status` = 1 limit 1