app/Http/Controllers/Product.php

select * from `products` order by `id` desc limit 10 offset 0
select count(*) as aggregate from `products`
---
    public function index()
    {
        $products = ProductModel::orderBy('id', 'desc')->paginate(10);